package org.example.이론;

public class d_springboot {
    // 스프링 (프레임워크) VS 스프링부트

    // cf) 엔터프라이즈 애플리케이션 : 대규모의 복잡한 데이터 관리
    // : 이를 대비하기 위한 서버 성능, 안정성, 보안을 제공하는 도구 - 스프링

    // 스프링부트
    // : 빌드 구성을 단순화하는 스프링부트 스타터를 제공
    // : XML 설정을 하지 않고도 자바 코드로 작성이 가능
    // : JAR를 이용하여 자바 옵션만으로 배포 가능

    // - 스프링과 스프링부트의 차이
    // 1) 구성의 차이
    // : 스프링 코어 | 스프링 MVC에 있는 기능을 자동 로드 (수동 환경 구성 X)

    // 2) 내장 WAS의 유무
    // : 스프링부트는 WAS를 자체적으로 가짐
    // : jar 파일만 생성하면 별도로 WAS를 설정하지 않아도 애플리케이션 실행이 가능
}
